#__author__:'Faning Huang'
#__time__:'2017/11/10 0010 下午 8:53'
menu = {
    '深圳市':{
        '福田区':{
            '园岭':{'123'},
            '南园':{'123'},
            '华富':{'123'},
            '莲花':{'123'},
            '福田':{'123'},
            '沙头':{'123'},
            '香蜜湖':{'123'},
            '梅林':{'123'},
        }
        "罗湖区":{
            "黄贝":{'123'},
            "东门":{'123'},
            "南湖":{'123'},
            "桂园":{'123'},
            "笋岗":{'123'},
            "清水河":{'123'},
            "翠竹":{'123'},
            "东湖":{'123'},
            "东晓":{'123'},
            "莲塘":{'123'},
        }
        '南山区':{
            '南头':{'123'},
            '南山':{'123'},
            '招商':{'123'},
            '蛇口':{'123'},
            '粤海':{'123'},
            '沙河':{'123'},
            '西丽':{'123'},
            '桃源':{'123'},
        }
        '盐田区':{
            '沙头角':{'123'},
            '梅沙':{'123'},
            '盐田':{'123'},
            '海山':{'123'},
        }
        '宝安区':{
            '新安':{'123'},
            '西乡':{'123'},
            '福永':{'123'},
            '沙井':{'123'},
            '松岗':{'123'},
            '公明':{'123'},
            '光明':{'123'},
            '石岩':{'123'},
            '观澜':{'123'},
            '龙华':{'123'},
        }
        '龙岗区':{
            '布吉':{'123'},
            '坂田':{'123'},
            '南湾':{'123'},
            '平湖':{'123'},
            '横岗':{'123'},
            '龙岗':{'123'},
            '龙城':{'123'},
            '坪地':{'123'},
            '坑梓':{'123'},
            '坪山':{'123'},
            '葵涌':{'123'},
            '大鹏':{'123'},
            '南澳':{'123'},
        }
    }
    '广州市':{
        '荔湾区':{'沙面''华林''多宝''昌华''逢源''龙津''金花''彩虹''南源''西村''站前''岭南''桥中'},
        '越秀区':{'洪桥''北京''六榕''流花''光塔''人民''东山''农林''大东''大塘街道''珠光''白云''建设''华乐''梅花村''黄花岗''矿泉''登峰'},
        '海珠区':{'赤岗''新港''昌岗''江南中''滨江''素社''海幢''南华西''龙凤''沙园''南石头''凤阳''瑞宝''江海''琶洲''南洲''华洲''官洲'},
        '天河区':{'五山''员村''车陂''沙河''石牌''兴华''沙东''林和''棠下''猎德''冼村''天园''天河南''元岗''黄村''龙洞''长兴''凤凰''前进''珠吉''新塘'},
        '黄埔区':{'萝岗''夏港''联和''东区''永和''黄埔''红山''鱼珠''大沙''文冲''南岗''荔联''穗东''长洲'},
        '白云区':{'三元里''松洲''景泰''黄石''同德''棠景''新市''同和''京溪''永平''均禾''鹤龙''石井''金沙''白云湖''石门''云城''嘉禾''江高镇''人和镇''太和镇''钟落潭镇'},
        '番禺区':{'市桥''桥南''东环''沙头''洛浦''大石''小谷围''钟村''石壁''大龙''南村镇''沙湾镇''石碁镇''石楼镇''新造镇''化龙镇'},
        '花都区':{'花城''新华''新雅''秀全''狮岭''炭步镇''花山镇''赤坭镇''梯面镇''花东镇'},
        '增城区':{'荔城''增江''朱村''永宁街道''中新镇''石滩镇''新塘镇''小楼镇''派潭镇''正果镇''仙村镇'},
        '从化区':{
            '街口':{},
            '城郊':{},
            '江埔':{},
            '太平镇':{},
            '温泉镇':{},
            '良口镇':{},
            '吕田镇':{},
            '鳌头镇':{}
        }
        '南沙区':{'南沙''龙穴''珠江''万顷沙镇''黄阁镇''横沥镇''榄核镇''大岗镇''东涌镇'},
    }
}

back_flag = False

while True:
    while not back_flag:
        for key in menu:
            print(key)
        choice = input(">>>:").strip()
        if choice in menu:
            while not back_flag:
                for key2 in menu[choice]:
                    print(key2)
                choice2 = input ("2>>>:").strip()
                if choice2 == "b":
                    back_flag = True
                if choice2 in menu[choice]:
                    while not back_flag:
                        for key3 in menu[choice][choice2]:
                            print(key3)
                        choice3 = input("3>>>:").strip()
                        if choice3 == "b":
                            back_flag = True
                        if choice3 in menu[choice][choice2][choice3]:
                            while not back_flag:
                                for key4 in menu[choice][choice2][choice3]:
                                    print(key4)
                                choice4 = input("4>>>:").strip()
                                print("last level")
                                if choice4 == "b":
                                    back_flag = True
                            else:
                                back_flag = False
                    else:
                        back_flag = False
            else:
                back_flag = False
    else:
        back_flag = False



